lib/tasks/save_videos.rake

SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" ASC LIMIT $1  [["LIMIT", 1]]
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 62]]
SELECT "videos".* FROM "videos" WHERE "videos"."id" BETWEEN $1 AND $2  [["id", 62], ["id", 101]]
---
     task save_video: :environment do
         Video.find_videos(%w(筋トレ ストレッチ ザ•きんにくTV))
         from = Video.first.id
         to = Video.first.id + 39
         Video.where(id: from..to).destroy_all