lib/tasks/send_youtube.rake

SELECT "users".* FROM "users"
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = $1 LIMIT $2  [["user_id", 113], ["LIMIT", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."category_name" = $1  [["category_name", "筋トレ"]]
UPDATE "users" SET "start_time" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["start_time", "2021-03-31 12:38:01.762942"], ["updated_at", "2021-03-31 12:37:01.768199"], ["id", 32]]
UPDATE "clocks" SET "start_time" = $1, "updated_at" = $2 WHERE "clocks"."id" = $3  [["start_time", "2021-04-14 09:31:04.000622"], ["updated_at", "2021-04-14 09:30:04.003240"], ["id", 10]]
---
    task send_line: :environment do
        users = User.all
        users.each do |user|
        if (user.clock.present?) && Time.now.strftime("%Y-%m-%d %H:%M") == (user.clock.start_time + user.clock.set_time * 60).strftime("%Y-%m-%d %H:%M")
            videos = Video.where(category_name: user.clock.category)
            number = videos.length.-1
            n = rand(number)
            @video = videos[n]
            message = {
              type: 'text',
              text: "https://www.youtube.com/embed/#{@video.video_id}"
            }
            client = Line::Bot::Client.new { |config|
                config.channel_secret = ENV['CHANNEL_SECRET']
                config.channel_token = ENV['CHANNEL_TOKEN']
            }
            p client
            response = client.push_message(user.line_id, message)
            user.clock.start_time = (Time.now + user.clock.break_time * 60)
            user.clock.save