app/mailers/youtube_mailer.rb

  def youtube_mail(user)
    @user = user
    videos = Video.where(category_name: user.category)
---
SELECT "videos".* FROM "videos" WHERE "videos"."category_name" = $1  [["category_name", "ヨガ"]]