app/views/shared/_header.html.erb

      <ul class="navbar-nav">
      <% if @current_user&.clock.present? %>
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = $1 LIMIT $2  [["user_id", 668], ["LIMIT", 1]]