app/views/shared/_site_buttons.html.erb

SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = $1 LIMIT $2  [["user_id", 15], ["LIMIT", 1]]
---

          <% if @current_user&.clock.present? %>