app/views/home/top.html.erb

      <% if @current_user %>
      <% unless @current_user.clock.present? %>
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = $1 LIMIT $2  [["user_id", 139], ["LIMIT", 1]]