app/controllers/clocks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 143], ["LIMIT", 1]]
INSERT INTO "clocks" ("user_id", "start_time", "set_time", "break_time", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user =  User.find(session[:user_id])
    clock = Clock.new(clock_params)
    clock.user_id = user.id
    clock.start_time = Time.now
    clock.save!

SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = $1 LIMIT $2  [["user_id", 16], ["LIMIT", 1]]
DELETE FROM "clocks" WHERE "clocks"."id" = $1  [["id", 12]]
---
  def destroy
    if @user.clock.present?
       @user.clock.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def set_user_or_redirect
      if User.where(id: session[:user_id]).exists?