app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
---
  def top
    @user = User.new
    if session[:user_id]
     @current_user = User.find(session[:user_id])