app/controllers/users_controller.rb

      user_id = result["userId"]
      user_name = result["displayName"]

      user = User.create(name: user_name, email: user_id)
---
INSERT INTO "users" ("name", "line_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "吉岡　将"], ["line_id", "Ubdbe5d1bad3cc7a2b98fa5998c63d551"], ["created_at", "2021-04-15 01:31:32.776957"], ["updated_at", "2021-04-15 01:31:32.776957"]]