app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "start_time") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "よしおかしょう"], ["email", "10"], ["created_at", "2021-03-30 14:27:46.831324"], ["updated_at", "2021-03-30 14:27:46.831324"], ["start_time", "2021-03-30 14:27:46.830560"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def create
     @user = User.new(user_params)
     @user.start_time = Time.now
     if @user.save
        session[:user_id] = @user.id
        @current_user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 10]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def destroy
        user = User.find(params[:id])
        user.destroy
        @current_user = nil
        session.delete(:user_id)